import docx2html

input_folder = "/home/naresh/Work/Working/input"
json_folder = "/home/naresh/Work/Working/json"
output_folder = "/home/naresh/Work/Working/output"
folder_with_duplicate = "/home/naresh/Work/Working/duplicate"



varsha = {

 

    "मानसून": ["मानसून", "मैंगो शॉवर" ],
    "वर्षा": ["वर्षा", "बारिश", "मौसिनराम", "वृष्टिछाया"],
    "ऋतु": ["ऋतु"],
    "योजना": ["योजना"],
    "बाँध": ["बाँध", "बांध", "बैराज", "गांधी सागर"],
    "बाढ़": ["बाढ़", "सुनामी", "चक्रवात"],
    "प्रपात": ["प्रपात"],
    "नदी": ["नदी"],
    "सिंचाई": ["सिंचाई"]
}

guide_line_json = {
    "श्रीलंका":["श्रीलंका", "पाकिस्तान" , "चीन", "म्यांमार" , "बांग्लादेश" , "अफगानिस्तान" , "भूटान" , "मालदीव"],
    "झील":["झील"],
    "केन्द्रशासित":["केन्द्रशासित"],
    "पहाड़ी":["पहाड़ी", "पहाड़ि"],
    "सिंधु": ["सिंधु", "झेलम", "चेनाब", "रावी", "व्यास", "सिन्धु"],
    "ब्रह्मपुत्र": ["ब्रह्मपुत्र"],
    "गंगा": ["गंगा", "सोन", "कोसी", "चम्बल", "अलकनन्दा"],
    "महानदी": ["महानदी "],
    "नर्मदा": ["नर्मदा"],
    "तापी": ["तापी"], 
    "गोदावरी": ["गोदावरी"],
    "नदियाँ": ["नदि", "नदी"],

     "शैल": ["शैल", "चट्टान"],
    "विश्व":["विश्व"],
     "मृदा": ["मृदा", "मिट्टी", "मिट्टि"],
    "जलवायु": ["जलवायु"],
    "कर्क रेखा": ["कर्क रेखा"],
    "क्षेत्रफल": ["क्षेत्रफल ", "हेक्टेयर"],

    "तट": ["तट"],
    "सीमा": ["सीमा"],
    "विस्तार": ["विस्तार"],
    "राजधानी": ["राजधानी"],
    "द्वीप": ["द्वीप"],
    "अक्षांश": ["अक्षांश"],
    "रेखा": ["रेखा"],
    "अपवाह": ["अपवाह"],
    "मरूस्थल": ["मरूस्थल"],
   
    "दक्कन पठार": ["दक्कन", "डेक्कन", "प्रायद्वीपीय", "दक्षिणी पठार", "राजमहल", "मैकाल", "मेघालय पठार", "जयन्तिया", "बुन्देलखंड", "सतपुड़ा"],
    "अरावली": ["अरावली"],
    "विन्ध्याचल": ["विन्ध्याचल", "विंध्याचल"],
    "हिमालय": ["हिमालय", "काराकोरम", "पीरपंजाल", "जास्कर", "लद्दाख", "पीर पंजाल", "माउंट एवरेस्ट", "नंगा पर्वत", "पूर्वाचल"],
    "मालवा": ["मालवा"],
    "छोटानागपुर": ["छोटानागपुर", "छोटा नागपुर"],
   
    "दर्रा": ["दर्रा", "दर्रे", "दरे", "दरों"],

    "समूह": ["समूह", "शैल", "चट्टानों", "टर्शियरी", "चट्टाने"],
    "दण्डकारण्य": ["दण्डकारण्य"],
    "पश्चिमी घाट": ["पश्चिमी घाट", "कार्डमम", "अन्नामलाई", "इलायची", "नीलगिरि", "कयाल", "अनाइमुडी", "अनाईमुदी", "मालाबार", "बाबाबूदन", "पश्चिम-घाट"],
   
    "वर्षा": ["वर्षा", "मानसून", "बारिश"],
    "खनिज": ["खनिज", "लोहा"],
    "भूकम्प": ["भूकम्प", "भूकंप", "बाढ़", "सुनामी", "चक्रवात"],
    "बाँध": ["बाँध", "बांध", "बैराज"],
    "प्रपात": ["प्रपात"],
    "ज्वालामुखी": ["ज्वालामुखी"],
    "परियोजना": ["परियोजना", "बहुउद्देशीय"],
    "अभयारण्य": ["अभयारण्य"],
    "जनजाति": ["जनजाति"],

    "पूर्वी-घाट": ["पूर्वी-घाट"],
    "द्वीप": ["द्वीप"],
    "सिंचाई": ["सिंचाई"],
   
    "भौतिक प्रदेश": ["भौतिक प्रदेश"],
    "मैदान": ["मैदान"],
    "बायोस्फीयर रिजर्व": ["बायोस्फीयर", "रिजर्व"],
    "राष्ट्रीय उद्यान": ["राष्ट्रीय उद्यान", "राष्ट्रीय पार्क", "पार्क"],
    "आरक्षित क्षेत्र": ["आरक्षित क्षेत्र"],
    "अधिनियम": ["अधिनियम"],
    "तिरुवनंतपुरम":["तिरुवनंतपुरम", "तिरूवनन्तपुरम" , "ध्वनि"],
    "वन क्षेत्र": ["वन क्षेत्र", " वन "],
    "मैंग्रोव": ["मैंग्रोव", "मैन्ग्रोव", "मैंग्रोव", "सुन्दरवन", "सुंदरी"],
    "कटिबन्धीय": ["कटिबन्धीय"],
    "सदाबहार": ["सदाबहार"],
    "जैव विविधता": ["जैव विविधता"]
}

udhyog = {

    "उद्योग":["उद्योग"],
}

prashnakal = {

    "प्रश्नकाल":["प्रश्नकाल"]
}

parichay = {

    "तट रेखा":["तट"],
    "क्षेत्रफल":["क्षेत्रफल" , "संख्या" , "कितने" , "आकार" , "हेक्टेयर" , "विस्तार"],
    "स्थिति":["देशान्तर","देशांतर", "अक्षांश" , "पश्चिम" , "पूर्व"  , "थिति" , "कर्क", "दक्षिण", "विस्तृत"],
    "मानक समय":["मानक", "समय"],
    "स्थान":["स्थान" , "प्वाइंट"],
    "सीमा":["सीमा" , "पाकिस्तान" , "चीन" , "अफगानिस्तान" , "नेपाल" , "श्रीलंका" , "क्रीक" ,"मालदीव"],
    # "anya":[" "]
}

rajanitik = {
    "स्थित":["स्थित" , "किस" , "सुमेल"],
    "केंद्रशासित प्रदेश":["केंद्रशासित" , "संघ राज्य", "संघीय क्षेत्र"],
    "राजधानी":["राजधानी"],
    "गठन":["गठन"],
}

bhautik_vibhajan = {
   
    "लक्षद्वीप":["लक्षद्वीप"],
    "अंडमान और निकोबार":["अंडमान" , "निकोबार" , "बंगाल की खाड़ी"],
    "द्वीप":["द्वीप" , "इंदिरा प्वाइंट" , "इंदिरा बिन्दु" , "रामेश्वरम्" , "धनुष्कोडि"],
    "मरुस्थल":["मरुस्थल" ,"कच्छ" ],
    "तटीय मैदान":["तटीय मैदान","तटीय क्षेत्र","पश्चिमी तट","पश्चिम तटीय", "पूर्वी तट" , "कयाल" , "कोंकण", "मालाबार" , "कोरोमंडल", "काठियावाड़", "गोवा"],
    "मैदान":["मैदान" , "डेल्टा" , "भाबर" , "तराई"],
    "उत्तर पुर्व का पठार":["ंमेघालय" , "उत्तर पुर्व का पठार",  " गारो","खासी","जयन्तिया"],
    "दक्कन का पठार":["अरावली", "पठार" ,"विंध्य", "मालवा","अजंता", "कैमुर" , "छोटा नागपुर","छोटानागपुर", "छोटा-नागपुर"  "अरावली" , "दक्कन" ,"डेक्कन", "सतपुड़ा" , "राजमहल" , "महादेव" , " प्रायद्वीपीय", "मैकाल" ,],
    "पश्चिमी घाट":["पश्चिमी घाट" ,"सहयाद्र", "अनाइमुडी" , "नीलगिरि" , "कार्डामम" ,"कार्डमम",  "अन्नामलाई" , "इलायची" , "बाबाबूदन" , "अनाईमुदी" , "सतमाला" , "माण्डव"],
    "पूर्वी घाट":["पूर्वी घाट" , "पूर्वी-घाट" ,"शेवरॉय" ,"जावादी" , "पालकोंडा" , "नलामल्ला" , "महेंद्र" ],
    "दण्डकारण्य":["दण्डकारण्य" , "दंडकारण्य"],
    "हिमालय":["हिमालय" ,"हिमाद्री" ,"उत्तराखंड",  "हिमाचल","पूर्वाचल", "पूर्वांचल", "नागा" , "मिजो", "शिवालिक" , "लद्दाख", "जास्कर", "काराकोरम" ,"पीर पंजाल" ,"पटकोई","पटकाई", "पीरपंजाल","नंगा पर्वत","नंदा देवी", "धौलाधर", "एवरेस्ट", "कंचनजंगा", "अन्नपूर्णा" , "धौलागिरि" , "हिमनद" ,"ग्लेशियर" ],

    "चट्टान":["चट्टान" , "शैल" , "धारवाड़"],
             "तट रेखा":["तट रेखा"],
             "दर्रा":["दर्रा", "दरे" , "दर्रे", "दरों", "नाथू ला" , "लिपु लेख" , "शिपकी ला", "भोरघाट" , "पालघाट"],
             "घाटी":["घाटी"],
             "चोटियां":["चोटि" , "चोटी" , "शिखर"],

    "तट":["तट"],
            #  "अन्य":[" "]
}

rivers_and_tributaries = {
        "झील":["झील" , "लोकटक" , "कयाल", "पुलीकट" , "चिल्का" , "कोलेरू" , "लोनार"],
    "प्रपात":["प्रपात" , "जोग" , "झरना"],
    "नर्मदा": ["नर्मदा", "तवा", "हथनी", "शक्कर", "दुधी", "तेंदु" , "अमरकण्टक"],
    "गोदावरी": ["गोदावरी", "प्रणहिता", "इंद्रावती", "मंजीरा", "पेंगंगा", "वैनगंगा", "मूला", "प्रवरा", "सबरी", "किरणसानी"],
    "कृष्णा": [ "कृष्णा", "भीमा", "तूंगभद्रा", "घाटप्रभा", "मूसी", "हगरी"],
    "कावेरी": [ "कावेरी", "भवानी", "अमरावती", "काबिनी", "शिम्सा", "लक्ष्मणतीर्थ", "अर्कावती"],
    "महानदी": ["महानदी", "शिवनाथ", "जोंक", "तेल"],
    "ताप्ती": [ "ताप्ती", "पूर्णा", "गिरना", "अंजनी", "वाघूर" , "तापी"],
    "दामोदर": ["दामोदर", "बराकर", "जमुनिया", "कोनार"],
    "सिंधु": ["सिंधु","लिद्दर",  "झेलम", "चिनाब","चेनाब", "सिन्धु", "क्षिप्रा", "भागा",  "रावी", "व्यास", "सतलुज","सतलज",  "गिलगित", "श्योक", "शिगार", "जास्कर"],
    "ब्रह्मपुत्र": ["ब्रह्मपुत्र","ब्रह्मपुत्र", "लोहित", "दिबांग", "सुबनसिरी", "धनसिरी", "तीस्ता", "मानस", "कामेंग", "धनसिरी" , "संकोश"],
    "गंगा": ["अलकनंदा", "भागीरथी","मंदाकिनी","चम्बल",   "गंगा", "यमुना", "घाघरा", "गंडक", "कोसी", "सोन", "गोमती", "रामगंगा", "शारदा", "दामोदर", "बराकर" , "चंबल", "बेतवा", "कनक", "सिंध", "तौंस"],
    "अन्य नदिया":["नदि" , "नदी"],
        # "अन्य":[ " "]
}



urja = {

    # "anya":[""],
        "परमाणु": ["परमाणु", "आणवि", "नाभिक", "अणु" , "न्यूक्लियर"],
        "सुपर":["सुपर"],
    "तापीय": ["तापीय", "ताप", "थर्मल" , "लिग्नाइट","अल्ट्रा", "क्रिटिकल", "धर्मल"],
        "बायोमास":["बायो" , "सरसों"],
    "गैस":["गैस"],
    "ज्वारीय": ["ज्वार"],
    "पवन": ["पवन", "विंड"],
    "चम्बल":["चम्बल"],
    "जल विद्युत": ["जल विद्युत", "जलविद्युत", "विद्युत गृह", "जल", "माही" ,"पन विद्युत","व्यास",  "भाखड़ा" , "बाँध"],
    "सौर ऊर्जा":["सौर", "सोलर"],

    " गैर-पारम्परिक":[" गैर-पारम्परिक", "गैर"],
    "अक्षय":["अक्षय" , "ग्रीन"],
    "परियोजना":["परियोजना"],
    "योजना":["योजना"],
    "निगम":["निगम" , "लिमिटेड"],

    
}



fasale = {
    "गेहूँ": ["गेहूँ" , "गेहूं"],
    "दूध": ["दूध", "डेयरी", "श्वेत क्रांति", "दुग्ध" , "पशु" , "मवेशि" , "बकरी", "मवेशी"],
    "तम्बाकू": ["तम्बाकू"],
    "चाय": ["चाय"],
    "कॉफी": ["कॉफी", "Coffee", "कहवा"],
    "कपास": ["कपास"],
    "बाजरा":["बाजरा"],
    "रबर": ["रबर" , "रवर" , "रबड़"],
    "दाल": ["दाल", "अरहर", "मूंग", "मसूर", "उड़द" , "चना" , "दलहन" , "राजमा" , "मटर"],
    "गन्ना": ["गन्ना", "गन्ने", "चीनी" , "शक्कर"],
    "चावल": ["चावल", "धान"],
    "मक्का": ["मक्का" , "मक्के"],
    "मसालों": ["मसालों", "मसाल", "मसाली" ,"इलायची" , "लौंग", "मिर्च" , "अदरक"],
    "फल": ["फल" , "आम" , "अमरूद" , "आंवला"],
    "नारियल": ["नारियल"],
    "सोयाबीन":["सोयाबीन"],
        "नीली क्रांति": ["नीली क्रांति", "मत्स्य", "मछली", "फिश", "फिश फार्मिंग" , "झींगा"],
    "हरित क्रांति": ["हरित", "क्रांति", "क्रान्ति", "उन्नत बीज", "हाई यील्डिंग वैरायटी", "फर्टिलाइजर", "सिंचाई"],
    "लाख": ["लाख", "लाख उत्पादन"],
    "रेशम": ["रेशम", "सेरीकल्चर" , "सिल्क"],
    "पटसन": ["पटसन"],
    "तिलहन": ["तिलहन", "पीत क्रांति", "सरसों", "सूरजमुखी" , "तिल" , "अलसी"],
    "पुष्पकृषि": ["पुष्पकृषि", "फ्लोरीकल्चर"],
    "बागवानी": ["बागवानी", "हॉर्टीकल्चर" , "वागवानी"],
    "जूट":["जूट"],
    "केसर":["केसर"],
    "सब्जियाँ":["प्याज" , "सब्जि" , "सब्जी" , "आलू"],   
    "एग्रो-इकोलॉजिकल क्षेत्र":["एग्रो-इकोलॉजिकल क्षेत्र"  , "एग्रो इकोलॉजिकल जोंस"],
    "झूम":["झूम" , "माशा"],
    # "रबी":["रबी" , "खरीफ" , "जायद"],

    # "अन्य कृषि संबंधित प्रशन":[" "]
}

khanij = {
   
    "संगमरमर": ["संगमरमर", "मार्बल"],
    "ग्रेनाइट": ["ग्रेनाइट", "ग्रेनाईट"],
    "चूना पत्थर": ["चूना पत्थर", "चूने",     "लाइम स्टोन",     "लाइमस्टोन"],
    "पाइराइट्स": ["पाइराइट्स"],
    "तेल व गैस भंडार": ["तेल", "ऑयल", "पेट्रोलियम", "मीथेन", "गैस", "पेट्रोल" , "जीवाश्म ईंधन" , "पनागुडी"],
    "कोयला": ["कोयला", "कोयल"],

    "रॉक फॉस्फेट": ["रॉक फॉस्फेट", "रॉक-फॉस्फेट", "रॉक फास्फेट"],
    "जिप्सम": ["जिप्सम"],
    "टंगस्टन": ["टंगस्टन"],

    "घीया पत्थर": ["घीया पत्थर", "सोप स्टोन"],
    "फ्लोर्सपार": ["फ्लोर्सपार"],
    "पोटाश": ["पोटाश"],

    "मैंगनीज": ["मैंगनीज", "मैगनीज"],
    "चाँदी": ["चाँदी", "चांदी"],
    "ग्रेफाइट": ["ग्रेफाइट"],
    "बाक्साइट": ["बाक्साइट", "बॉक्साइट"],
    "तांबा": ["तांबा", "कॉपर", "ताँब", "ताम्र" , "तांबे"],
    "सीसा-जस्ता": ["सीसा", "लेड", "जस्ता", "जिंक"],
    "सोना": ["सोना", "गोल्ड", "स्वर्ण", "सोने"],
    "लौह अयस्क": ["लौह", "अयस्क", "आयरन ओरे", "लौह-अयस्क", "लिग्नाइट", "लिग्नाईट", "लोहा" , "बैलाडिला"],
    "खनिज तेल": ["खनिज तेल", "मिनरल ऑयल"],
    "नाइकेल": ["नाइकेल", "निकेल"],
    "यूरेनियम": ["यूरेनियम"],
    "पारा": ["पारा", "मरकरी"],
    "अभ्रक": ["अभ्रक", "माइका"],
    "कोबाल्ट": ["कोबाल्ट"],
    "प्लेटिनम": ["प्लेटिनम"],

    "टिन": ["टिन"],
    "जिरकोन": ["जिरकोन"],
    "चिलर": ["चिलर"],
    "क्रोमाइट": ["क्रोमाइट"],

    "ऐलुमिनियम": ["ऐलुमिनियम", "एल्युमिनियम", "अलुमिनियम", "ऐल्युमिनियम", "नाल्को"],
    "बेंटोनाइट": ["बेंटोनाइट", "बेन्टोनाइट", "बेन्टोनाइट", "बेण्टोनाइट"],
    "डोलोमाइट": ["डोलोमाइट"],
    "क्योलिन": ["क्योलिन", "चायनी क्ले"],

    "सिलिमेनाइट": ["सिलिमेनाइट"],
    "शिस्ट": ["शिस्ट"],
    "तामड़ा": ["तामड़ा",    "गार्नेट"],

    "क्यायनाइट": ["क्यायनाइट"],
    "टैल्क": ["टैल्क"],
    "एस्बेस्टोस": ["एस्बेस्टोस", "एस्बेस्टॉस", "ऐस्बेस्टॉस", "ऐस्बेस्टोस"],
    "बाराइट": ["बाराइट"],
    "मैग्नेसाइट": ["मैग्नेसाइट"],
    "चाइना क्ले": ["चाइना क्ले"],
    "कलिनाइट": ["कलिनाइट"],
    "डायस्पोर": ["डायस्पोर"],
    "एमराल्ड": ["एमराल्ड"],

    "रेड ऑक्साइड": ["रेड ऑक्साइड"],
    "वर्मीक्युलाइट": ["वर्मीक्युलाइट"],
    "जियोलाइट": ["जियोलाइट"],
    "एंटिमनी": ["एंटिमनी"],
    "गैलियम": ["गैलियम"],
    "इंडियम": ["इंडियम"],
    "रेडियोधर्मी खनिज": ["रेडियोधर्मी खनिज", "रेडियोएक्टिव मिनरल्स"],
    "रेयर अर्थ एलिमेंट्स": ["रेयर अर्थ एलिमेंट्स"],
    "सल्फर": ["सल्फर"],
    "वोल्फ्रामाइट": ["वोल्फ्रामाइट"],
    "वैनाडियम": ["वैनाडियम"],
    "यिट्रियम": ["यिट्रियम"],
    "जिंकाइट": ["जिंकाइट"],
    "सोडियम सल्फेट": ["सोडियम सल्फेट"],
    "अल्लुवियल सोना": ["अल्लुवियल सोना"],
    "फुलर्स अर्थ": ["फुलर्स अर्थ"],
    "हेमेटाइट": ["हेमेटाइट"],
    "इल्मेनाइट": ["इल्मेनाइट"],
    "सिल्वाइट": ["सिल्वाइट"],
    "सिल्वेनाइट": ["सिल्वेनाइट"],
    "स्टिबनाइट": ["स्टिबनाइट"],
    "जाइरोक्सीन": ["जाइरोक्सीन"],
    "अन्य पत्थर": ["पत्थर"],
    "वोल्टस्टोनाइट": ["वोल्टस्टोनाइट", "वोलैस्टोनाइट", "वोलास्टोनाइट"],
    "बेरीलियम": ["बेरीलियम", "बेरिलियम"],
    "फेल्सपार": ["फेल्सपार"],
    "बेराइटस": ["बेराइटस"],
    "क्वार्टज": ["क्वार्टज",   "क्वार्टजाइट"],
    "सेलेनाइट": ["सेलेनाइट", "सैलेनाइट"],
    "कैल्साइट": ["कैल्साइट"],
    "हीरे": ["हीरे", "हिरा", "हीरा"],
    "जास्पर": ["जास्पर"],
    "थोरियम": ["थोरियम"],
    "पन्ना": ["पन्ना", "पन्ने"],
    "गैरू": ["गैरू"],
    "फास्फोराईट": ["फास्फोराईट"],
    "फ्लोराइट": ["फ्लोराइट"],
    "लिथियम": ["लिथियम"],
    "निकल": ["निकल"],
    "क्ले वाले खनिज": ["क्ले", "फॉयर क्ल", "मुल्तानी मिट्टी", "फायरक्ले", "बॉल क्ले", "चीनी मिट्टी", "सिलिका"],
    "अन्य खनिज": ["खान", "खनिज"],
    "परमाणु": ["परमाणु", "आणवि", "नाभिक"],
    "इस्पात": ["इस्पात", "स्पात", "स्टील", "IISCO", "TISCO", "भिलाई", "आयरन"],
    "तापीय": ["तापीय", "ताप विद्युत"],
    "ज्वारीय": ["ज्वार"],
    "पवन": ["पवन", "विंड"],
    "जल विद्युत": ["जल विद्युत", "जलविद्युत", "विद्युत गृह", "जल"],
    "नमक": ["नमक"],
     "शैल": ["शैल", "चट्टान"],
}




jalvayu = {
    "कोपेन": ["कोपेन", "BShw", "BWhw", "Cwg", "Amw", "As"],
    "थार्नथ्वेट": ["थार्नथ्वेट"],
    "त्रिवार्था": ["त्रिवार्था"],
    "मानसून": ["मानसून", "मैंगो शॉवर", "एलिफेंटा"],
    "वर्षा": ["वर्षा", "बारिश", "मौसिनराम", "वृष्टिछाया" , "चेरापूंजी" , "पश्चिमी विक्षोभ" , "नार्वेस्टर"],
    "जलवायु":["जलवायु" , "पवन","शुष्कतम" , "वायुमण्ड", "तापान्तर" ,"तापांतर","तापमान", "समताप", "शुष्क", " वायुदाब पेटी" ],
    # "अन्य जलवायु संबंधित प्रश्न":[" "]
}

parivahan = {
    "रोपवे":["रोपवे" , "रोप-वे"],
    "सड़क": ["सड़क","रोडवेज","रोड","परिवहन विभाग","राष्ट्रीय मार्ग","रोड़","NH","सडक","हाइवे","बस","पथ परिवहन", "उत्तर-दक्षिण गलियारे","राष्ट्रमार्गों", "राजमार्ग", "गोल्डन चतुर्भुज", "ईस्ट वेस्ट कॉरिडोर", "स्वर्णिम चतुर्भुज", "ग्रेट डेक्कन राजपथ", "हाईवे", "एक्सप्रेस मार्ग"],
    "रेलवे": ["रेल", "ट्रेन", "मालगाड़ी" , "मेट्रो", "थार एक्सप्रेस"],
    "वायु परिवहन":["वायु" , "हवाई", "विमान" , "हवाई" , "एयरफोर्स"],
    "जल परिवहन": ["जल","बन्दरगाह", "मुंद्रा","खाड़ी", "शिप", "नौ" ,"तट", "जहाज",  "पत्तन" , "बंदरगाह" , "पोत" ,"पाराद्वीप", "कांडला", "संदरगाह", "हल्दिया", ]
}

aapdae= {
    "भुकंप":["भुकंप", "भुकम्प", "भूकंप"],
    "बाढ़":["बाढ़"],
    "सुखा":["सुखा" , "सूखा"],
    "तटिय आपदाए":["चक्रवात" , "झंझा" , "सुनामी"],
    "भूस्खलन":["भूस्खलन"],
    # "अन्य आपदा संबंधित प्रश्न":[" "]
}

mittiya = {
    "काली मिट्टी":["काली" , "रेगुर" , "लावा"],
    "लाल मिट्टी":["लाल"],
    "लैटेराइटी":["लैटेराइट"],
    "जलोढ़ मिट्टी":["जलोढ़" ,"जलोद", "खादर" , "भांगर","भाबर", "बाँगड़" , "कछारी" , "बांगर", "दोमट" ],
    "अपरदन" :["अपरदन"],
    "क्षारीय-अम्लीय":["अम्लीय" , "क्षारीय" , "तेजावी" , "लवण" ],
    "अन्य मिट्टीया":["पॉडजोल", "पाडजोल", "पीट" , "लोएस" , "लोनी" , "चरनोजम" ,"भूरी" , "दुम्मटी"],
    # "अन्य मिट्टी संबंधित प्रश्न":[" "]
}

pariyojanaye = {
    "नर्मदा घाटी परियोजना":["नर्मदा" , "सरदार सरोवर"],
    "कावेरी नदी पर बने बांध":["कावेरी"],
    "चंबल घाटी परियोजना":["चंबल", "गांधी सागर", "राणा प्रताप सागर"],
    "गोविन्द वल्लभ पंत सागर":["गोविन्द" ,"गोविंद", "रिहंद"],
    "टिहरी बांध परियोजना":["टिहरी"],
    "दामोदर घाटी परियोजनाएं":["दामोदर", "बराकर" , "तिलैया"],
    "हीराकुड बांध परियोजना":["हीराकुड" , "महानदी", "हीराकुंड"],
    "सिंधु व सहायक नदी पर बांध":["चिनाब", "सतलज", "व्यास", "झेलम", "रावी"],
    "भाखड़ा-नांगल बांध":["भाखड़ा" , "नांगल"],
    "कृष्णा":["कृष्णा", "कृष्णा"],
    "गोदावरी":["गोदावरी"],
    "अन्य बांध व परियोजनाए":["बांध","डैम", "बैराज" , "बाँध", "शिवसमुद्रम", "परियोजना" , "बहुउद्देशीय", "जलविद्युत" , "प्रोजेक्ट"],
    "सिंचाई":["सिंचाई" , "नहर" ,"कूप" , "कुआँ" , "तालाब"],
    # "कूप":["कूप"],
    # "नहर":["नहर"],
    # "अन्य":[" "]
}

vanaspati = {
    # "रिपोर्ट":["रिपोर्ट", "प्रकाशन" , "रिपोर्ट" , "2011" , "सर्वेक्षण"],
    # "वनस्पति":[" "],

    # "मिट्टी": ["मिट्टी", "मृदा", "मिट्टि", "जलोढ़", "लैटेराइट"],
    # "बायोस्फीयर": ["बायोस्फीयर"],
    # "हॉट स्पॉट": ["स्पॉट"],
    # "आरक्षित": ["आरक्षित", "संरक्षित"],
    # "उद्यान": ["उद्यान", "पार्क"],
    # "विरासत": ["विरासत"],
    # "अधिनियम": ["अधिनियम", "नीति", "रिपोर्ट", " दिवस"],

    # # "मैंग्रोव": ["मैंग्रोव", "मैन्ग्रोव", "मैंग्रोव", "सुन्दरवन", "सुंदरी"],
    # "कटिबन्धीय": ["कटिबन्धीय", "कटिबंधीय" , "उष्णकटिबंधीय"],
    # "सदाबहार": ["सदाबहार"],
    # "पतझड़": ["पतझड़"],
    # "अभयारण्य": ["अभयारण्य"],
    # "विहार": ["विहार"],
    # "अल्पाइन": ["अल्पाइन", "शंक" , "देवदार"],
    # "जलवायु": ["जलवायु"],
    # "जैव विविधता": ["विविधता", "प्रजातियाँ"],
    #     "वन क्षेत्र": ["वन"],
    # "वृक्ष": ["वृक्ष"],
    # "करेवा": ["करेवा"],
    # "घास": ["घास"],
    # "कृषि": ["कृषि", "खेती"],
    # "अन्य ":[" "]
}

continents = {
    "राजस्थान":["राजस्थान"],
    "अमेरीका":["अमेरीका" ,  "अमेरिका"],
    "एशिया":["एशिया"],
    "अफ़्रिका":["अफ्रिका" , "अफ्रीका", "अफ़्रीका" , "अफ़्रिका", "अफ्रीक"],
    "आस्ट्रेलिया":["आस्ट्रेलिया", "स्ट्रेलिया" , "स्ट्रेलीया" , "ऑस्ट्रेलिया"],
    "यूरोप":["युरोप" , "यूरोप"],
    "अंटार्कटिका":["अंटार्कटिका" , "अंटार्कटीका"],
    "महाद्विप":["महाद्विप" , "महाद्वीप"],
}

oceans = {
    "हिन्द महासागर":["हिन्द महासागर", "हिंद महासागर", " हिंद ", " हिन्द "],
    "आर्कटिक":["आर्कटिक"],
    "अटलांटिक":["अटलांटिक"],
    "प्रशांत":["प्रशांत" , "प्रशान्त"]
}

vishva = {
  "विश्व व ब्रह्माण्ड अवधारणा": ["रह्माण्ड" , "आकाशगंगा" , "तारे" , "चंद्रशेखर सीमा" , "श्याम-विवर" , "कृष्ण विवर" , "कृष्ण छिद्र" , " एस. चंद्रशेखर" , "सुपर नोवा" , "तारामंडल" , "खगोलीय" , "अंतरिक्ष" , "नक्षत्र" , "हब्बल" , "प्रकाश वर्ष"],
  "सौरमंडल": ["सौरमंडल"],
  "सूर्य": ["सूर्य" , "हीरक वलय"],
  "बुध": ["बुध"],
  "शुक्र": ["शुक्र"],
  "पृथ्वी": ["पृथ्वी" , "भूपर्पटी"],
  "मंगल": ["मंगल"],
  "बृहस्पति": ["बृहस्पति"],
  "शनि": ["शनि"],
  "अरुण, वरुण एवं प्लूटो": ["अरुण", "वरुण", "प्लूटो"],
  "चंद्रमा": ["चंद्रमा", "चंद्रग्रहण"],
  "क्षुद्रग्रह": ["क्षुद्रग्रह"],
  "विषुवत रेखा-भूमध्य रेखा": ["विषुवत रेखा", "भूमध्य रेखा"],
  "धूमकेतु एवं उल्का": ["धूमकेतु", "उल्का" , "पुच्छल तारा"],
  "पृथ्वी अक्षांश": ["अक्षांश" , "विषुवत"],
  "देशांतर": ["देशांतर", "ग्रीनविच" , "प्रधान मध्याह्न रेखा", "मानक समय" , "प्रधान याम्योत्तर" , "अंतरराष्ट्रीय तिथि रेखा"],
  "कर्क रेखा": ["कर्क रेखा"],
  "मकर रेखा": ["मकर रेखा"],
  "दिन-रात": ["दिन", "रात", "अयनांत" , "जून 21"],
  "पृथ्वी की उत्पत्ति": ["पृथ्वी की उत्पत्ति"],
  "भूगर्भिव": ["भूगर्भिव", "हिमयुग", "हिमकाल" , "डायनासोर" , "पटपरा"],
  "चट्टाने": ["चट्टाने", "शैल" , "चट्टान"],
  "ज्वालामुखी": ["ज्वालामुखी" , "किलिमंजारो" , "स्ट्राम्बोली" , "अकांकागुआ"],
  "भूकम्प": ["भूकम्प" , "रिक्टर" , "सुनामी"],
  "महाद्वीप": ["महाद्वीप"],
  "विश्व की पर्वत श्रेणियां": ["पर्वत श्रेणियां" ,"आल्पस", "एलबुर्ज", "मैकेंजी", "फ्यूजीयामा" ,"पिरिनी","गोलन हाइट्स",   "डार्लिंग श्रृंखला" , "ब्रिटिश कोलम्बिया", "पर्वत" ,"एंडीज", "रॉकीज"],
  "पठार": ["पठार", "पामीर"],
  "घाटियां": ["घाटि" , "घाटी", "वैली" , "बेसिन"],
  "शुष्क प्रदेश-मरुस्थल": ["शुष्क प्रदेश", "मरुस्थल", "रेगिस्तान", "दश्त-ए-लु", "अटाकामा"],
  "घास मैदान": ["घास मैदान" , "वेल्ड", "स्टेपीज", "पम्पाज", "प्रेयरीज", "कैम्पास", "सवाना", "लानोज", "सेल्वास","सेल्वा", "टैगा",  "डाउन्स"],
  "विश्व के देश एवं उनकी सीमाएं": ["विश्व के देश", "सीमाएं"],
  "अधीन क्षेत्र": ["अधीन क्षेत्र", "ग्रीनलैंड", "केटालोनिया"],
  "स्थलरुद्ध देश": ["स्थलरुद्ध देश", "लाइबेरिया", "चाड", "लाओस", "बोलीविया", "अफगानिस्तान" , "दक्षिण सूडान" ,"बोत्सवाना",  "अजरबैजान"],
  "देशों के पुराने नाम": ["देशों के पुराने नाम"],
  "अंतर्राष्ट्रीय सीमा रेखाएं": ["अंतर्राष्ट्रीय सीमा", "डूरंड" , "रैडक्लिफ", "मैगिनॉट"],
  "देशों की राजधानियां": ["राजधानि", "राजधानी"],
  "विश्व के नगर": ["विश्व के नगर"],
  "भौगोलिक उपनाम": ["भौगोलिक उपनाम", "उत्तर का वेनिस","नहरों का शहर","पर्ल ऑफ साइबेरिया", "यूरोप की तेल राजधानी",  "विश्व की छत", "ब्लू ग्रास स्टेट" ,"झीलों की वाटिका",  "वेत हाथी की भूमि"],
  "जलमडल": ["जलमडल", "डेटम रेखा", "जलमंडल", "नाईन्टी ईस्ट रिज"],
  "विश्व के प्रमुख सागर": ["विश्व के प्रमुख सागर","अरल सागर", "सफेद सागर","लाल सागर",  "सारगैसो सागर", "टेरहेनियन सागर",  "काला सागर", "कैस्पियन सागर", "भूमध्य सागर"],
  "महासागरीय धाराएं": ["महासागरीय धाराएं"],
  "लवणता": ["लवणता"],
  "ज्वारभाटा": ["ज्वारभाटा"],
  "महासागरीय गर्त": ["महासागरीय गर्त"],
  "विश्व की नदियां": ["विश्व की नदियां"],
  "नदियों के किनारे स्थित नगर": ["नदियों के किनारे स्थित नगर"],
  "नदियों द्वारा निर्मित स्थल रूप": ["नदियों द्वारा निर्मित स्थल रूप"],
  "द्वीप": ["द्वीप"],
  "झीलें एवं जलप्रपात": ["झीलें", "जलप्रपात"],
  "जलडमरूमध्य": ["जलडमरूमध्य"],
  "नहरें": ["नहरें"],
  "विश्व के प्रमुख बांध": ["बांध"],
  "प्रवाल भित्ति": ["प्रवाल"],
  "वायुमण्डल": ["वायुमण्डल"],
  "सूर्यातप एवं तापमान": ["सूर्यातप", "तापमान"],
  "चक्रवात": ["चक्रवात"],
  "आर्द्रता": ["आर्द्रता"],
  "वायुदाब": ["वायुदाब"],
  "बादल": ["बादल"],
  "हवाएं": ["हवाएं"],
  "स्थानीय पवन": ["स्थानीय पवन"],
  "वन": ["वन"],
  "विश्व जलवायु": ["जलवायु"],
  "मृदा": ["मृदा"],
  "प्रजाति-जनजातियां": ["प्रजाति", "जनजातियां"],
  "भाषाएं": ["भाषाएं"],
  "आर्थिक भूगोल कृषि एवं पशुपालन": [ "कृषि", "पशुपालन"],
  "खनिज कोयला": ["कोयला"],
  "लौह अयस्क": ["लौह अयस्क"],
  "तांबा": ["तांबा"],
  "सोना": ["सोना"],
  "चांदी": ["चांदी"],
  "एल्युमीनियम": ["एल्युमीनियम"],
  "टिन": ["टिन"],
  "पेट्रोलियम": ["पेट्रोलियम"],
  "यूरेनियम": ["यूरेनियम"],
  "खनिज - विविध": ["खनिज",],
  "नगर और उद्योग": ["नगर", "उद्योग"],
  "परिवहन": ["परिवहन"],
  "पत्तन-बंदरगाह": ["पत्तन", "बंदरगाह"],
  "विविध": ["विविध"]
}

jilla = {

    "jilla":["जिला", "जिले", "ज़िला" , "ज़िले", "जीला" , "जीले" , "संभाग" ,"जिलों","जिलो", "सम्भाग"]
}


# udhyog = {
#         "वनस्पति घी":["घी"],
        #    "ज्वैलरी":["ज्वैलरी" ,],
    # "वस्त्र": ["वस्त्र","कपड़ा", "टैक्सटाईल","पावरलूम", "टैक्सटाइल्स","वूलन", "कताई",  "रेशम","वूलन", "साड़ी", "होजरी", "सूती", "ऊनी", "ऊन" , "मैनचेस्टर", "बोस्टन" , "ऊनी" , "रेशे"],
    # "जलयान निर्माण": ["जलयान", "शिपयार्ड", "पोत-निर्माण"],
    # "एल्युमिनियम": ["एल्युमिनियम", "बाल्को", "नाल्को", "हिंडालको" , "एल्युमीनियम"],
    # "लौह और इस्पात": ["लौह", "इस्पात", "टिस्को", "राउरकेला", "भिलाई", "बोकारो", "स्टील"],
    # "सीमेंट": ["सीमेंट","सीमेन्ट", "सीमेण्ट", "पोरबंदर", "डालमिया नगर"],
    # "उर्वरक व रसायन": ["सीसा","बायोडीजल","कैमिकल्स","फार्मास्यूटिकल", "ड्रग्स", "जस्ता", "उर्वरक","रसायन","फर्टीलाइजर","फर्टिलाइजर्स", "केमिकल्स" ,"डीएपी",  "खाद", "IFFCO", "NFL", "पनकी", "सिंदरी", "केमिकल"],
    # "कागज": ["कागज", "नेपानगर", "टीटागढ़", "ब्रजराजनगर"],
    # "जूट": ["जूट", "भाटपाड़ा"],
    # "प्लास्टिक उद्योग":["प्लास्टिक"],
    # "पेट्रो रसायन": ["पेट्रो रसायन","रिफाइनरी","रिफायनरी",  "जामनगर", "हल्दिया", "नागथेन" , "पेट्रो"],
    # "तांबा": ["तांबा", "खेत्री"],
    # "ग्लास":["ग्लास", "काँच"],
   
    # "हस्तशिल्प":["हैण्डलूम","खादी","ग्रामोद्योग", "हस्त","शिल्प","हस्तशिल्प","राजसीको", "हथकरघा","बुनकर","यार्न","हैण्डीक्राफ्ट", "RAJSICO", "जड़ाई कटाई व पोलिश"],
    # "चमड़ा उद्योग":["चमड़ा" , "टेनरीज"],
    # "शुगर मिल":["शुगर","चीनी","शूगर" ],
    # "sarakar":["सरकार"],
    # "नमक":["नमक","साल्ट",],
    # "ग्रेनाईट":["ग्रेनाईट" , "स्टोन", "ग्रेनाइट", "पत्थर"],
    # "औद्योगिक प्रदेश":["औद्योगिक प्रदेश" ,"जोन","पार्क","उद्योग केन्द्र" ,"औद्योगिक","इंडस्ट्रियल जोन", "इंडस्ट्रियल कॉरिडोर", "इंडस्ट्रियल कॉरिडोर", "कॉरिडोर","कोरिडोर"],

    # "kendriya":["हिन्दुस्तान कॉपर लिमिटेड", "हिन्दुस्तान जिंक लिमिटेड" , "हिन्दुस्तान मशीन टूल्स","हिन्दूस्तान मशीन टूल्स", "इन्स्टुमेंटेशन लिमिटेड" , "चांदमारी ताम्र परियोजना" , ],
    # "अन्य उद्योग":["घी","ज्वैलरी" ,"फुटवियर","गलीचा", "बीड़ी","बिजली के मीटर", "टायर" ,"माचिस", "शराब", "छाता" , "टॉयज", "खेलकूद" ],
    #  "इंजीनियरिंग": ["इंजीनियरिंग","इलेक्ट्रॉनिक", "अभियान्त्रिक" "इन्स्टुमेन्टेशन","अभियान्त्रिक" "अभियांत्रिक","कार", "हेवी मशीनरी", "हेवी इलेक्ट्रिकल्स", "इलेक्ट्रॉनिक्स","इंस्टुमेंटेशन",],
    # "उद्योग केन्द्र":[, ],
    # "पार्क":[ ],
    # "निगम":[],
    # "संस्था":["संस्था", "निगम" , "एजेन्सी" , "बोर्ड", "स्पिनफैड", "अनुसंधान केन्द्र", "RIICO", "परिषद", " "],
    # "योजना":["योजना"]
    # }
    
paryatan = {
        # "महोत्सव":["महोत्सव","फेस्टीवल" , "फेस्टिवल" ],
        # "सर्किट":["सर्किट", "सकिंट" , "सक्रिंट" , "परिपथ", "त्रिकोण", ],
        # "मेला":["मेला"],
        # "संग्रहालय":["संग्रहालय", "म्यूजियम"],
        # "पैनोरमा":["पैनोरमा"],
        # "रोपवे":["रोपवे" , "रोप-वे"],
        # "सफारी":["सफारी"],
        # "विश्व धरोहर":["धरोहर", "विरासत", "यूनेस्को"],
        # "पार्क":["पार्क"],
        # "रेलगाड़ी":["रेलगाड़ी", "व्हील्स"],
        # "RTDC":["RTDC"],
        # "पर्यटन विभाग":["पर्यटन विभाग","संस्थान","इंस्टीट्यूट","Center of","वर्ष",  "दिवस", "पर्यटन विकास निगम" ,"होटल निगम",  "पर्यटन पुलिस", "पर्यटन संभाग" ,"पर्यटन सम्भाग ", "पर्यटन निदेशालय"],
        # "योजना":["योजना" , "नीति", "पॉलिसी" , "कोष"],
        # "कहाँ":["कहाँ", "कहां" , "स्थित"],
        # "पर्यटक":["पर्यटक" , "प्रवासियों"],
        "पर्यटन":[" "]
    }

pashupalan = {
        # "राजस्थान में पशुपालन - अन्य प्रश्न":[""],
    "पशुगणना":["पशुगणना" , "2019" , "पशु गणना", "पश गणना" , "पशु घनत्व", "पशु गणना" , "20वी" , "पशुधन"],
    # "गधों":["गध",],
    #  "खच्चर":[ "खच्चर"],
    # "मछली":["मछली" , "मछलिया" , "मत्स्य", "मछलि"],
    # "अश्व":["अश्व" , "खच्चर" , "घोड़े", "घोड़ा", "घोड़ों" , "टटू"],
    # "ऊँट": ["ऊँट" , "ऊष्ट्र", "ऊंट", "ऊँट", "ऊंटों", "ऊंट"],
    # "भैंस":["भैंस", "भैंस", "भैस", "भैंस", "मुर्रा"],
    # "भेड़": ["भेड़", "भेंड़", "भेड़","भेड़", "भेड", "शीप"],
    # "बकरी": ["बकरी" , "बकरि",],
    # "गाय": ["गाय", "गौ" ,"कामधेनु", "गोवंश", "गोवंश", "गौवशं", "गायों", "गौवंश","कांकरेज", "राठी", "थारपारकर"],
    # "मेला":["मेला" , "मेले", "मेलों"],
    # "ऊन":["ऊन"],
    # "डेयरी":["डेयरी" , "दुग्ध", "डेयरी" , "RCDF", "परेटिव" , "उरमूल" , "गंगमूल" , "सरस" , "वरमूल"],
    # "मुर्गि":["मुर्गि" , "मुर्गिया" , "मुर्गियों" , "मुर्गियाँ" , "अण्डा" , "मुर्गी", "अण्डों", "मुर्गे", "मुर्गा" , "कुक्कुट" , "अंड"],
    # "सुअर":["सुअर" , "सूअरों"]
}

jansankhya = {

    # "जनगणना":[" "],
    "अनुसूचित जनजाति":["जनजाति", "जनजाती" , "आदिवासी" , "भील"],
    "अनुसूचित जाति":["जाति" , "जाती"],

    # "धर्म":["धर्म" , "ईसाई", "बौद्ध", "सिख", "जैन", "मुस्लिम"],
    # "2011":["2011"],
    # "1991":["1991" , "2001"],
    # "विश्व":["विश्व"],
    "पंचवर्षीय": ["पंचवर्षीय"],
    "नीति": ["नीति"],

    "साक्षरता": ["साक्षरता", "साक्षर"],
    "लिंगानुपात": ["लिंगानुपात", "लिंग अनुपात", "लिंग - अनुपात", "यौनानुपात", "लिंग-अनुपात", "स्त्रि", "स्त्री", "पुरुष"],

    "घनत्व": ["घनत्व", "घनी", "घना", "विरल", "सघनता"],

    # "वृद्ध":["वृद्ध"],
    # "जनसंख्या वृद्धि":[],

    "भाषा":["भाषा"],
    "जन्म दर": ["जन्म दर", "जन्म-दर", "जन्मदर", "मृत्यु दर", "मृत्युदर", "मृत्यु-दर", "प्रजनन दर", "वृद्धि-दर", "जनसंख्या वृद्धि", "वृद्धि", "2001-2011"],


    # "भाषा":["भाषा"],
    "नगरीकरण": ["शहरीकृत", "नगरीकृत", "मेट्रो", "दसलाखी नगर", "दस लाखी नगर", "नगरीकरण", "नगरीयकरण", "नगरीय जनसंख्या", "नगर", "शहर", "शहरीकरण"],
    "जनगणना": ["जनगणना", "जनसंख्या",],
}


jal = {
# "जल संरक्षण":["जल संरक्षण" ,"रिसोर्स मैनेजमेंट","प्रबन्धन", "जल संसाधन विभाग", "फ्लोरोसिस", "वाटर मैनेजमेन्ट",  "जल स्वावलम्बन", "जलग्रहण प्रबंधन", "राजेंद्रसिंह", "भूजल" , "जल संचय", "जल दिवस", "भूमिगत जल", "जल संग्रहण" , "स्वावलंबन", "भू-जल"],
# "जवाई बांध":["जवाई"],
# "बीसलपुर सिंचाई योजना":["बीसलपुर"],
# "नर्मदा परियोजना":["नर्मदा"],
# "माही बजाज सागर परियोजना":["माही"],
# "भाखड़ा नांगल परियोजना":["भाखड़ा", "नांगल"],
# "व्यास परियोजना":["व्यास"],
# "चम्बल परियोजना":["चम्बल" , "चंबल" , "कोटा बैराज"],
# "गंगनहर":["गंगनहर" ,"गंगासिंह" , "गंग नहर"],
# "सिंचित क्षेत्र":["सिंचित क्षेत्र" , "नलकूप" , "कुआँ" , "सिंचाई स्त्रोत" , "नलकुप" , "सिंचाई क्षेत्र" , "कुओं", "सिंचाई के साधन" , "सिंचाई का प्रमुख स्रोत"], 
# "इन्दिरा गांधी नहर":["इन्दिरा गांधी", "इंदिरा गांधी" , "राजस्थान नहर" , "इन्दिरा गाँधी", "इंदिरा गाँधी" , "IGNP"],
# "अन्य बाँध व परियोजनाएं":["बाँध" , "बाँच", "बाँघ" , "परियोजना", "लिफ्ट स्कीम", "लिफ्ट नहर" , "डेम", "जल सुरंग", "जल सुंग", "बांध"],
# "अन्य जल संसाधन संबंधित प्रश्न":[""]
}


nadi = {

        "6. राजस्थान  झील":["झील" , "झिल" , "लेक"],
    #    "पश्चिमी बनास":[ "पश्चिमी बनास" , "कूकडी" , "सुकली" , "सीपू"],
           "आयड़":["आयड़" , "बेड़च" , "आयड" , "बेडच" , "गंभीरी" , "गम्भीरी"],
               "घग्घर नदी":["घग्घर"],
    # "गंभीर":["गंभीर" , "पार्बती" , "गम्भीर"],
    "चम्बल नदी":["चम्बल" , "चंबल" ,  "पार्वती" , "सीप" , "काली सिंध" ,"कालीसिन्ध", "परवन" ,"कालीसिंध" , "आहू" , "चाकण" , "मांगली" , ],
 
    "बनास नदी":[ "बनास" , "मोरेल" , "कालीसिल" , "मांसी" , "कोठारी" , "मेनाल" , "खारी", "डाई", ],
    "लूनी नदी":["लुनी" , "नाग पहाड़ी" , "जवाई" , "सुकड़ी" ,"सूकड़ी", "लूनी" , "लूणी"  , "जोजड़ी" , "बाण्डी"],
    "माही नदी":["माही" , "सोम" , "जाखम" , "मोरेन" , "चाप" , "अनास"],

    # "साबरमती":["साबरमती" , "मानसी", "मेश्वा" , "सेई", "माजम" , "वाकल"],

    "अंतः प्रवाही":["आन्तरिक अपवाह", "अन्तः प्रवाह", "बाण गंगा" ,"बाणगंगा", "साबी" , "कांतली" ,"कातंली", "रूपारेल" , "रुपारेल" , "काकनी" , "काकनेय" , "खण्डेला" , "मेंथा" ,"मेन्था", "खारी" , "आंतरिक अपवाह तंत्र"],
    "अन्य नदियां":[""]
}



fasal = {

    
"अन्य कृषि संबंधित प्रश्न":[" "],
    # "मक्का":["मक्का"],
    # "तिलहन":["तिल" , "सरसों" , "मूंगफली", "सोयाबीन" , "अलसी" , "तारामीरा" , "अरण्डी" , "अरंडी"],
    # "दलहन":["दलहन" , "मोठ" , "चना" ,"चने", "उड़द" , "मूंग" , "अरहर"],
    
    # "बाजरा":["बाजरा", "बाजरे"],
    #     "फुल":["फुल" , "फूल" , "गुलाब"],
    # "फल":["फल" , "संतरा" , "अमरूद" , "खरबूजा", "तरबूज","अनार", "मौसमी", "माल्टा" , "किन्नू"],
    # "ग्वार":["ग्वार"],
    # "कपास":["कपास"],
    # "तम्बाकू":["तम्बाकू"],
    # "ईसबगोल":["ईसबगोल", "आसबगोल"],
    # "जोजोबा":["जोजोबा" , "होहोबा"],
    # "अफीम":["अफीम" , "मादक"],
    # "मेहन्दी":["मेहन्दी" , "मेहंदी"],
    # "नींबू":["नींबू" , "नींंबू"],

    # # "सरसों":["सरसों"],
    # "गेहूँ":["गेहूँ" , "गेहूं" ,"गेहूँ" ],
     
    # "चावल":["चावल" , ],
    #  "अनुसंधान केन्द्र":["अनुसंधान" , "विश्वविद्यालय" ,"अनुसन्धान","अनुसंधान संस्थान", "संस्थान" , "बीज प्रमाणीकरण संस्था", "उत्कृष्टता केन्द्र", "निगम" , "CAZRI"],
    # "गन्ना":["गन्ना" , "गन्ने"],
    # "जौ":["जौ"],
    # "मसाला":["मसाला", "मसाले" , "जीरा" , "हल्दी" , "धनिया" , "मिर्च" , "मेथी" , "मैथी", "लहसुन" , "अजवाइन" , "तुलसी" , "अदरक" , "सौंफ" , ],
    # "प्याज":["प्याज"],
    # "जेतून":["जेतून", "जैतुन" ,"जेतुन" "जैतून"],
    # "चैती":["चैती"],
    # "खजूर":["खजूर"],
    # "रतनजोत":["रतनजोत" , "जेट्रोपा"],

    # # "सोयाबीन":["सोयाबीन"],
    # "ज्वार":["ज्वार"],
    # "नगदी":["ग्वार", "कपास","तम्बाकू", "ईसबगोल", "जोजोबा", "जैतून" , "अफीम" , "होहोबा"],

   
    # "मण्डी":["मण्डी" ,"मंडी", " विपणन बोर्ड" , "राज्य कृषि उद्योग निगम" , "क्रय-विक्रय संघ" , "कृषि फार्म" , "फूड पार्क्स" , "मंडियाँ"],
    # "नीति":["नीति"],
    # "कृषि गणना":["कृषि गणना"],
    # "सूखा":["सूखा" , "सूग्वा" , "सूखे" , "अकाल"],
    # "योजना":["योजना" , "मिशन" , "कार्यक्रम"],
    # "क्रान्ति":["क्रान्ति" , "क्रांति"], 
    # "कृषि जलवायु":["जलवाय" , "कृषि पारिस्थितिकी"],
    # "स्थानान्तरित कृषि":["स्थानान्तरित कृषि" , "दजिया","दाजिया" ,"चिमाता" , "वालरा", "झूम", "झूमिंग"],
    # "कल्चर":["कल्चर"],


    

}


van = {
# "जयसमंद":["जयसमंद" , "जयसमन्द"],
# "नाहरगढ़":["नाहरगढ़"],
# "जमवा":["जमवा"],
# "अभयारणय":["अभयारण्य", "अभ्यरण्य", "अभय" , "अभ्य"],
# "कंजर्वेशन रिजर्व":["कंजर्वेशन", "रिजर्व" , "रिज़र्व"],
# "सफारी":["सफारी"],
# "योजना":["योजना"],
# "पुरस्कार":["पुरस्कार"],
# "अधिनियम":["अधिनियम"],
# "मरुस्थलीकरण":["मरुस्थलीकरण"],
# "उष्ण कटिबन्धीय":["उष्ण", "कटिबन्धीय"],
# "वन्यजीव":["वन्य जीव", "वन्यजीव"],
# "आखेट":["आखेट"],
# "मृगवन":["मृगवन"],
"जन्तु आलय":["जन्तु आलय", "आलय" ,"zoo" , " " ],
# "घास":["घास"],
# "गोडावन":["गोडाव" , "बस्टर्ड"],
# "पक्षि":["पक्षि", "पक्षी"],
# "प्राणी":["प्राणी" ,"पशु" , "जानवर"],
# "रामसर":["रामसर" , "आर्द्रभूमि" , "वेटलैण्ड"],
# "चिंकारा":["चिंकारा"],
# "जैव विविधता":["जैव", "विविधता"],
# "खेजड़ी":["खेजड़ी"],

}



anupgarh = {
    "संभाग": ["संभाग"],
    "उपनाम": ["उपनाम"],
    "विश्वविद्यालय": ["विश्वविद्यालय"],
    "जनजाति": ["जनजाति"],
    "अकादमी": ["अकादमी", "संस्था"],
    "लोकनाट्य": ["लोकनाट्य"],
    "मंडी": ["मंडी"],
    "हवाई अड्डाव": ["हवाई अड्डाव", "हवाई", "अड्डा"],
    "Establishment": [
        "स्थापना",
        "प्राचीन नाम",
        "जिले से अलग",
        "जिलों से अलग"
    ],
    "Geography": [
        "सीमा",
        "भौतिक प्रदेश",
        "अंतर्राष्ट्रीय सीमा",
        "अपवाह"
    ],
    "LiveStock": ["नस्ल", "गाय", "अश्व", "प्रजनन"],
    "Climate": ["जलवायु"],
    "Water Bodies": ["नदी", "झील" , "नदि"],
    "Soil and Agriculture": ["मृदा", "मिट्टी"],
    "फसल": ["फसल", "कृषि फार्म"],
    "Irrigation": [
        "नहर", "बांध", "बाँध",
        "सिंचाई", "लिफ्ट", "परियोजनाएं", "तालाब"
    ],
    "पार्क": ["पार्क", "पार्क"],
    "अभ्यारण्य": ["अभ्यारण्य", "अभयारण्य", "कंजर्वेशन","रिजर्व" , "आखेट"],
    "पॉटरी": ["पॉटरी"],
    "विश्व धरोहर": ["विश्व धरोहर"],
    "छतरियां": ["छतरि", "छतरी"],
    "मस्जिद": ["मस्जिद", "मकबरा", "मजार" , "दरगाह" , "दरगाह"],
 
    "महल": ["महल"],
    "महोत्सव": ["महोत्सव"],
    "शिलालेख": ["शिलालेख", "अभिलेख"],
    "पुरातात्विक स्थल": ["पुरातात्विक स्थल"],
    "Culture and Religion": [
        "लैला मजनू",
        "धार्मिक स्थल",
        "लोक देवी",
        "गुरुद्वारा",
        "पैनोरमा"
    ],
    "मेला": ["मेला", "मेले"],
    "Events and Movements": [
        "आंदोलन", "आन्दोलन",
        "किसान आंदोलन",
        "हत्याकांड","हत्याकाण्ड",
        "गोलीकांड"
    ],
    "Resources": [
        "पेट्रोलियम",
        "खनिज",
        "रिफाइनरी",
        "पत्थर",
        "कॉपर",
        "तांबा"
    ],
    "उद्योग": ["उद्योग", "सीमेंट", "कारखाना", "फैक्ट्री" , "औद्योगिक केंद्र"],
    "चित्र शैली": ["चित्र शैली"],
    "संप्रदाय": ["संप्रदाय" , "संत"],
    "सिक्के": ["सिक्के"],
    "एकीकरण": ["एकीकरण"],
    "लोक देवता": ["लोक देवता" , "लोक संत"],
    "वन क्षेत्र": ["वन क्षेत्र"],
    "Historical Significance": ["वीरता घटना"],
    "कवि": ["कवि"],
    "वनस्पति": ["वनस्पति"],
    "भाषा": ["भाषा" , "बोली"],
    "Demographics and Administration": [
        "विधानसभा",
        "तहसील",
        "नगर पालिका",
        "उपखंड"
    ],
    "मंदिर": ["मंदिर"],
    "दुर्ग": ["दुर्ग", "किला"],
    "नृत्य": ["नृत्य"],
    "प्रिंट": ["प्रिंट"],
    "योजना": ["योजना"],
    "सभ्यता": ["सभ्यता"],
    "प्रदेश": ["प्रदेश"],
    "घटना": ["घटना"],
    "कुलदेवी": ["माता", "कुलदेवी", "कुल देवी"],
    "हवेली": ["हवेली"],
    "बावड़ी": ["बावड़ी" , "बावड़ी"],
    "पहला":["पहला" , "प्रथम"],
    "गांव": ["गांव"],
    "युद्ध": ["युद्ध"],
}

places = {
    "01 अनूपगढ़": ["अनूपगढ़"],
    "02 बालोतरा": ["बालोतरा"],
    "03 डीग": ["डीग"],
    "04 केकड़ी": ["केकड़ी"],
    "05 जयपुर ग्रामीण एवं जयपुर": ["जयपुर ग्रामीण" ],
    "06 नीम का थाना": ["नीम का थाना"],
    "07 सलूंबर": ["सलूंबर"],
    "08 शाहपुरा": ["शाहपुरा"],
    "09 डीडवाना-कुचामन": ["डीडवाना-कुचामन"],
    "11 सांचौर": ["सांचौर"],
    "12 फलौदी": ["फलौदी"],
    "13 गंगापुर सिटी": ["गंगापुर सिटी"],
    "14 जोधपुर": ["जोधपुर ग्रामीण"],
    "15 दूदू": ["दूदू"],
    "16 कोटपुतली-बहरोड़": ["कोटपुतली-बहरोड़"],
    "17 खैरथल-तिजारा": ["खैरथल-तिजारा"],
    "anya":[" "]
}



history = {
    "1. वैदिक काल": [ 70,164],
"2. उत्तर वैदिक काल": [ 91,110,111,112,114,130,140],
"3. महा जनपद काल": [26, 156],
"4. बौद्ध धर्म": [ 5, 65,84,109,121],
"5. जैन धर्म": [ 141],
"6. मगध का उत्कर्ष": [ 136,137,142 ],
"7. विविध-1": [ 1,17,22,23,39,79,80,82,84,99,116,117,118,120,125,135,146,157,158,159,160,162],
"8. मौर्य काल": [107],
"9. मौर्योत्तर काल": [ ],
"9.1 शुंग कण्व चेदी": [ 43,63,74,75,77,78 ],
"9.2 सातवाहन": [ ],
"9.3 यवन पश्चिमी आक्रांत": [ 16,45,128,139 ],
"10.संगम काल": [ ],
"11. विविध -2": [ 13,14,18,19,20,35,37,41,86,88,96,117,118,120,125,135,146,157,158,159 ],
"12. गुप्त काल": [ 34,38,44,57,58,59,71,87,89,92,93,102,105,113,132,143,144,150,151,152 ],
"13. वर्धन काल": [ 21, 53,54,55,56,108,127,131,],
"14. पूर्व मध्यकाल उत्तर भारत": [ 25, 42,46,47,69,97,98,100,115,147],
"15. पूर्व मध्य काल दक्षिण भारत": [ 30,36,145 ],
"16. विविध-3": [2,6,7,8,9,11,12,15,24,28,29,31,32,33,34,40,48,49,50,51,52,60,61,62,64,66,67,68,72,76,81,83,90,94,95,101,103,104,106,119,122,123,124,126,129,133,134,148,149,153,154,155,161,163]
}

docx2html.segregate_question_using_number("/home/naresh/Work/Working/input/itihas.docx", output_folder, {
    **history,
})

# docx2html.segregate_question(input_folder, output_folder,  {
#     # **anupgarh,
#     **places
#     # **van
#     # **nadi,
#                                     # **jal
#                                 # **pashupalan
#                                 # ** jilla
#                                 # **vishva
#                                 # **continents,
#                                 # **oceans,
#                                 # **vanaspati,
#                                 # **pariyojanaye,
#                                 # **mittiya,
#                                 # **aapdae,
#                                 # **parivahan,
#                                 # **jalvayu,
#                                 # **jansankhya,
#                                 # **khanij,
#                                 # **fasal,
#                                 # **urja,
#                                 # **udhyog,
#                                 # **rivers_and_tributaries,
#                                 # **bhautik_vibhajan,
#                                 # **parichay,
#                                 # **rajanitik,
#                                 # **paryatan
#                                 }, True)


# ratta_functions.process_folder_for_given_function(output_folder, output_folder, ratta_functions.convert_txt_to_docx, "files")
docx2html.get_initial_idea_of_files_from_a_folder_recursively(input_folder)
docx2html.get_initial_idea_of_files_from_a_folder_recursively(output_folder)

